# Ultralytics YOLO 🚀, AGPL-3.0 license
# Enhanced YOLOv11s-seg for Pothole Detection (Paper Adaptation)
# Modifications: DSConv, SimAM, GELU

# Parameters
nc: 1 # number of classes (Sadece 'pothole' olduğu için 1)
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024] # Biz bunu kullanacağız (Small)
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# 1. GELU Activation 
activation: nn.GELU 

# YOLOv11.0s backbone
backbone:
  # [from, repeats, module, args]
  - [cite_start][-1, 1, Conv, [64, 3, 2]] # 0-P1/2 (İlk katman standart Conv olarak kalır [cite: 327])
  - [cite_start][-1, 1, DSConv, [128, 3, 2]] # 1-P2/4 (Downsample ile DSConv) [cite: 323]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, DSConv, [256, 3, 2]] # 3-P3/8 (Downsample ile DSConv)
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [cite_start][-1, 1, SimAM, []] # 5 (Attention added after C3k2 block) 
  - [-1, 1, DSConv, [512, 3, 2]] # 6-P4/16 (Downsample ile DSConv)
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, SimAM, []] # 8 (Attention added)
  - [-1, 1, DSConv, [1024, 3, 2]] # 9-P5/32 (Downsample ile DSConv)
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, C2PSA, [1024]] # 11 (YOLOv11'in kendi attention modülü)
  - [-1, 1, SimAM, []] # 12 (Attention added)

# YOLOv11.0s head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 8], 1, Concat, [1]] # cat backbone P4 (SimAM çıkışı olan 8. katman ile birleşir)
  - [-1, 2, C3k2, [512, False]] # 15
  - [cite_start][-1, 1, SimAM, []] # 16 (Attention added in Neck) [cite: 330]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 5], 1, Concat, [1]] # cat backbone P3 (SimAM çıkışı olan 5. katman ile birleşir)
  - [-1, 2, C3k2, [256, False]] # 19
  - [-1, 1, SimAM, []] # 20 (Attention added in Neck)

  - [cite_start][-1, 1, DSConv, [256, 3, 2]] # 21 (Head içindeki Conv yerine DSConv) [cite: 323]
  - [[-1, 16], 1, Concat, [1]] # cat head P4 (16. katman ile birleşir)
  - [-1, 2, C3k2, [512, False]] # 23
  - [-1, 1, SimAM, []] # 24 (Attention added)

  - [-1, 1, DSConv, [512, 3, 2]] # 25 (Head içindeki Conv yerine DSConv)
  - [[-1, 12], 1, Concat, [1]] # cat head P5 (12. katman ile birleşir)
  - [-1, 2, C3k2, [1024, True]] # 27
  - [-1, 1, SimAM, []] # 28 (Attention added)

  - [[20, 24, 28], 1, Segment, [nc, 32, 256]] # Detect(P3, P4, P5) - SimAM çıkışlarını alır